Revit 2027 API
FabricationConfiguration.GetAllDampers Method
 Gets all damper identifiers in the fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetAllDampers()
Public Function GetAllDampers As IList(Of Integer)
public:
IList<int>^ GetAllDampers()
member GetAllDampers : unit -> IList<int>
Return Value
IList<Int32>
 An array of specification identifiers.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace